
//Напишите программу, которая на вход принимает число и 
//выдаёт его квадрат (число умноженное на само себя).

/*
sdfdsfdsfsfsdfsdfds
*/

double input = double.Parse(Console.ReadLine());

double result = input * input;

Console.WriteLine(result);

int a = 5;
int b = 6;

if(input == result)
{
    Console.WriteLine("12312321");
    Console.WriteLine("sdfdaf");
    Console.WriteLine("dsfdsf");
}
else
{
    Console.WriteLine("False");
}